app/controllers/cows_controller.rb

SELECT  "cows".* FROM "cows" WHERE "cows"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_cow
      @cow = Cow.find(params[:id])