app/views/cows/index.html.erb

SELECT "calves".* FROM "calves" WHERE "calves"."cow_id" IN (1, 2, 3, 4, 5, 6)
---
        </h2>
          <% cow.calves.each do |calf| %>

SELECT "cows".* FROM "cows" GROUP BY "cows"."money"
SELECT SUM("cows"."money") AS sum_money, money AS money FROM "cows" GROUP BY "cows"."money"
---
            <div class="panel-body">
                <%= pie_chart Cow.group(:name).sum(:money) %>