app/views/cows/show.html.erb

  <div class="row">
    <% @cow.calves.each do |calf| %>
---
SELECT "calves".* FROM "calves" WHERE "calves"."cow_id" = $1  [["cow_id", 1]]